{"imDbId":"tt0371746","title":"Iron Man","fullTitle":"Iron Man (2008)","type":"Movie","year":"2008","items":[{"username":"MartinHafer","userUrl":"https://www.imdb.com/user/ur2467618","reviewLink":"https://www.imdb.com/review/rw2051155","warningSpoilers":false,"date":"12 April 2009","rate":"9","helpful":"10 out of 14 found this helpful.","title":"Considering I am not much of a fan of superhero movies, this one is a success","content":""},{"username":"TheLittleSongbird","userUrl":"https://www.imdb.com/user/ur20552756","reviewLink":"https://www.imdb.com/review/rw3067309","warningSpoilers":false,"date":"12 August 2014","rate":"9","helpful":"35 out of 40 found this helpful.","title":"A Marvel superhero film done with class","content":""},{"username":"bkoganbing","userUrl":"https://www.imdb.com/user/ur2483625","reviewLink":"https://www.imdb.com/review/rw1876779","warningSpoilers":false,"date":"19 May 2008","rate":"5","helpful":"8 out of 23 found this helpful.","title":"Iron Man Eats His Spinach","content":""},{"username":"Michael_Elliott","userUrl":"https://www.imdb.com/user/ur13134536","reviewLink":"https://www.imdb.com/review/rw1994644","warningSpoilers":false,"date":"23 December 2008","rate":"","helpful":"4 out of 5 found this helpful.","title":"Very Good","content":""},{"username":"Leofwine_draca","userUrl":"https://www.imdb.com/user/ur0482513","reviewLink":"https://www.imdb.com/review/rw3519845","warningSpoilers":true,"date":"6 August 2016","rate":"4","helpful":"2 out of 12 found this helpful.","title":"Scrapheap Challenge is more entertaining","content":"Hollywood crowd-pleaser or vapid ego-fest for all those concerned? My money's on the latter, but a lot of people seem to rave over this comic book adaptation that sees a Howard Hughes-style inventor making himself a metal suit and using it to fight various nefarious characters. In recent years I've seen the superhero genre on the wane, with boring and predictable outings lacking the spark that earlier hits enjoyed (such as SPIDER-MAN and DAREDEVIL, although I know I'm in the minority in liking the latter). IRON MAN to me was routine, overlong and frequently dull, telling the 'samey' kind of origin story we've been seeing since whenever, and definitely lacking in entertainment value.It didn't help that Tony Stark's character grated on me from the beginning. We're supposed to believe this arrogant weapons manufacturer has a change of heart and wants to do good for the world, all the while retaining his quirky charm. Puh-lease! In actual fact, I was on the side of the (unrecogniseable) Jeff Bridges, cast here as the mentor-turned-villain. Bridges was the only one in the film who seemed to have the right idea what to do with Stark, i.e. beat seven shades of hell out of him.The plot plods along, taking trips to the Middle East along the way for some bloodless hijinks that see Stark building himself a suit of iron out of a few left-overs. BLUE PETER for guys, if you will. It also returns to the area later on for a rather entertaining fight sequence, but action and pretty special effects alone can't win the day for Stark. After the umpteenth confrontation, we're left with the sight of two metal men beating the tar out of each other in a climax lifted from ROBOCOP 2, and the ending drags on forever. Sadly, Stark ends up saving the day, which means that a sequel was greenlit.Other things working against the film: Gwyneth Paltrow's robot-like performance as \"Pepper Potts\", with whom Stark's character shares mucho dull flirtation. What did Hollywood ever see in this actress? Terrence Howard's military man is as dull as dishwater, and the only minor moments of fun come from watching our hero make implausible use of his engineering skills. But then, if I wanted to see that, I'd rather plump for SCRAPHEAP CHALLENGE, I think."},{"username":"SnoopyStyle","userUrl":"https://www.imdb.com/user/ur2898520","reviewLink":"https://www.imdb.com/review/rw2918335","warningSpoilers":false,"date":"7 December 2013","rate":"8","helpful":"5 out of 5 found this helpful.","title":"RDJ is Iron Man","content":"Tony Stark (Robert Downey Jr.) is a hard playing billionaire genius. He is captured in Afghanistan after demonstrating his newest weapon. He is forced to create new weapons for his captor. Instead he makes an armored suit to escape. He also makes an arc reactor to keep his heart going and shrapnel from killing him. Once back in the States, he moves his company to concentrate on arc reactor technology and stop weapons manufacturing.This is all RDJ. He and he alone makes Iron Man work. It's doubtful if anybody could have done it better. It's certain that he's made it next to impossible to replace him. Director Jon Favreau has built around him the dazzling array of tech fun, and Gwyneth Paltrow as his Girl Friday. It is RDJ's fast talking, quick wit, and personal history that makes him the perfect Tony Stark. Great character, fun movie."},{"username":"Hitchcoc","userUrl":"https://www.imdb.com/user/ur0278527","reviewLink":"https://www.imdb.com/review/rw2153135","warningSpoilers":false,"date":"6 November 2009","rate":"8","helpful":"1 out of 2 found this helpful.","title":"No Iron! How Ironic!","content":"I got a kick out of this film. I have never seen one of the comic books nor do I know about the exploits of this figure. It is a nicely done superhero film which traces the origins of the character. Robert Downey is quite good, balancing his innate arrogance against his good intentions. Jeff Bridges is also an excellent adversary. One of the most impressive scenes in the move is the opening in the deserts of Afghanistan as a roadside bomb explodes and Downey and a group of soldiers come under fire. It really gives one a sense of what those people face each day. It may even be a bit real for a fantasy romp like this is. It is down and dirty. There are great events, including the building of the first suit and his effort to exact revenge against the forces that have used his weapons systems to persecute and destroy the civilian population. There is a lot of action and it's not superfluous. Downey's relationship with Gwyneth Paltrow and the robots in his lab are a lot of fun. For pure escapism, it's really fun. I assume the sequel is on its way."},{"username":"Kirpianuscus","userUrl":"https://www.imdb.com/user/ur61197531","reviewLink":"https://www.imdb.com/review/rw4053273","warningSpoilers":false,"date":"5 February 2018","rate":"","helpful":"1 out of 1 found this helpful.","title":"interesting","content":"I am far to be fan of comics. or Marvel universe. and , maybe, for an action film, I prefer Batman more than Ironman who, I admitt, was unknow for me before this film. the only motif to see the film was Robert Downey jr. and it is a serious motif. because, for an outsider, \"Ironman\" is real...cool. for humour, performances, meet between Jeff Bridges and Robert Downey, story, references to many episodes from superheroes adventures and, sure, but less, for CGI effects. it is part of a trend proposing its voice. with succes. and that defines it. so, enjoy it !"},{"username":"Horst_In_Translation","userUrl":"https://www.imdb.com/user/ur3914439","reviewLink":"https://www.imdb.com/review/rw3415592","warningSpoilers":true,"date":"15 February 2016","rate":"6","helpful":"0 out of 4 found this helpful.","title":"How it all began","content":"\"Iron Man\" is an American superhero film from 8 years ago and it was the great revival of Robert Downey Jr.'s career. Once a lauded young television actor and Oscar nominee for \"Chaplin\", he quickly faced the dark side of show business, but in 2008 he pursued his great comeback. And he should not only lead the \"Iron Man\" franchise, but quickly afterward also become the new \"Sherlock Holmes\" and certainly a superior one to Benedict Cumberbatch. But lets get back to this film we have here. It received great audience numbers and critics reviews and was one of the main reasons why superhero films are so much en vogue again. But it's not all Downey Jr.'s achievement. Jeff Bridges created a nice main antagonist shortly before his Oscar win and then there is of course Jon Favreau's (an actor himself, also appears in here) strong direction and a truly excellent script for such a genre film.Its biggest strength is probably how well-structured it all is. The first third is about the hostage situation, the second is about Stark's change in character and the consequences and the final third of the film is what you may call the boss fight. I generally don't mind if we find out about the main antagonist right away, but it was also nicely done with the path they chose here. Then again, Marvel fans certainly knew right away. It was a very smart decision. The terrorists were the main villains for at least half the film until we found out who was in charge of them really and there is one scene way into the second half during which we see they are not in control at all. It's also a decent development that will not offend people that follow the religion of Islam, who may have seen this film as being too much against their faith otherwise.The film runs for slightly over 2 hours with credits and that's perfectly fine. No need to stretch it to 150 minutes and the way it is it also never drags and is an enjoyable watch from start to finish. The only somewhat negative association I had came with Gwyneth Paltrow who was occasionally cringeworthy in her few scenes. Then again, I do not see much talent in her anyway. And one notion about the Transformers-like fight at the end. I would have preferred that the way he could have won would have been with that reference to freezing armor, which was very nice and certainly would have been my preferred choice over a collaboration battle with Paltrow's character. It also would have emphasized again what they were telling us for the entire film. Stark may have been a bon vivant, but he is also a lone wolf. Apart from that, I was happy that the film focused a lot more on story than on special effects and visuals. I wish more superhero films would go that route.As a whole, needless to say now that I enjoyed the watch and will certainly rewatch the second film and watch the third at some point. And I am not even speaking about the other Avengers film that I will certainly watch at some point in the future too. Thanks to Mr. Samuel L. Jackson for leading us towards them in the post-credit sequence. As for \"Iron Man\", this was a pretty good effort I must say. Delivered in basically all areas convincingly and I urge you to check this one out. On a final note, I liked that they cast fairly unknown actors for major supporting parts here such as Yinsen and Raza, also something that other (superhero) film makers should go for in the future."},{"username":"claudio_carvalho","userUrl":"https://www.imdb.com/user/ur2488512","reviewLink":"https://www.imdb.com/review/rw1949105","warningSpoilers":true,"date":"20 September 2008","rate":"7","helpful":"47 out of 96 found this helpful.","title":"Entertaining and Totally Overrated in IMDb","content":"The playboy wolf and genius Tony Stark (Robert Downey Jr.) is the successful CIO of the Stark Industries, a weapon company founded by his father. His second in command is Obadiah Stane (Jeff Bridges), who worked with his father, and his loyal and professional secretary is Pepper Potts (Gwyneth Paltrow), who has a crush on Tony. While in Afghnistan to demonstrate the ultimate Jericho missile developed by his company, his military convoy is attacked and Tony is seriously wounded on his chest and kidnapped by a group of rebels that wants him to assemble a missile for their use. Tony stays with his abductors for three months and develops a powerful metallic armor to escape from the cave where he is arrested. He decides to stop manufacturing weapons in his company under the protest of Obadiah, and dedicates his time to improve the armor, manufacturing it with gold and titanium and installing a propulsion system to fly. However, Pepper discovers that Tony was betrayed by Obadiah, who is using Tony's data to build prototype armor for him, transforming it in the ultimate weapon.\"Iron Man\" is an entertaining adventure, with great special effects and good and funny story, and nothing else. However, the User Rating of Top 250: #192 is absolutely overrated and offensive to the great movies of the cinema history. The IMDb formula may indicate the movies with massive votes and high rating but never the greatest movies of the cinema industry. My vote is seven.Title (Brazil): \"Homem de Ferro\" (\"Iron Man\")"},{"username":"bob the moo","userUrl":"https://www.imdb.com/user/ur1002035","reviewLink":"https://www.imdb.com/review/rw1944292","warningSpoilers":false,"date":"11 September 2008","rate":"","helpful":"9 out of 20 found this helpful.","title":"Far from a brilliant film but still a bright, breezy and enjoyable summer blockbuster","content":""},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw1928747","warningSpoilers":false,"date":"12 August 2008","rate":"8","helpful":"1 out of 2 found this helpful.","title":"Great performances","content":"I have to state, that I'm not an avid comic(graphic novel) book reader, so I can't point out any differences between the written (or drawn) world and the real (filmed) world. But I know that this movie was a lot of fun and it seems to owe many things to Batman Begins ... beginning with an ensemble cast!But the main actor here is of course Robert Downey Jr. If you have followed his career & private life (some ups, unfortunately many \"downs\" too, no pun intended), you have to be real happy seeing him getting recognized for his talent and finally beginning to explore his (acting) abilities and being confident enough to play major roles. This is apparent through the screen/his acting. He is very comfortable (not only because of the \"support\" cast, that ... supports him, Terence Howard, Gwyneth P. and Jeff B.) and this helps elevate the movie! It is fun & light, but with an honest message/warning (just like Mr. Downey himself)"},{"username":"classicsoncall","userUrl":"https://www.imdb.com/user/ur2707735","reviewLink":"https://www.imdb.com/review/rw1873147","warningSpoilers":true,"date":"12 May 2008","rate":"7","helpful":"3 out of 7 found this helpful.","title":"\"So you're a man who has everything,..., and nothing.\"","content":"So here I am in my late fifties with enough of a connection to my comic book collecting past to be intrigued by modern day super hero films. Now I was never a Marvel Comics geek, my favorite characters were the mainstays of the DC Comics universe, like Superman, Batman, Green Lantern, et al. But if you were a fan, you couldn't help but know about the alternative universe that contained Spider-Man, The Incredible Hulk, The X-Men and Iron Man, which brings us to the subject at hand. I thought that the movie did a credible job of spanning the forty year comic book history of Iron Man about as well as could be expected in a distilled down two hour movie. Particularly effective was the way we see how the origin costume in the picture pays tribute to the early Iron Man years, while the modern day red and gold armor conveys the advance of science and technology into the twenty first century. Comic book purists will most likely have serious issues with the picture, but I've been able to get over the whole faithfulness to continuity issue some time ago. What I'm looking for in a flick like \"Iron Man\" is an opportunity to be entertained for a couple of hours, and there's enough here to have some fun and be just that - entertained.The one thing I AM looking for in the Marvel universe pictures is the ubiquitous cameo appearance of Stan Lee, creator of many of the comic book icons we recognize today. He's incorrectly credited in the cast listing as I write this, as he's listed appearing as himself. What you need to do is pay attention to that party scene in the casino when Tony Stark says hi to 'Hef'. That was just the coolest way to get Stan into the picture, and I give him a lot of credit for not taking himself too seriously as he truly is one of the gods of comic book history.As for the picture, it's easy enough to bash it for it's adherence to current world events and the milieu of extremist terrorism. But is that any worse than reliving the events of the early 1960's and placing the character in the middle of the Bay of Pigs or the Cuban Missile Crisis? The present day Iron Man can be a product of his time and still be effective as a symbol of patriotism and honor, even while the rest of the country is immersed in presidential primaries and partisan politics.You have to give credit to the selection of Robert Downey Jr. for the Iron Man role. Perhaps his own bouts with substance abuse uniquely prepared him for an outstanding performance as the conflicted title character. However the character I was intrigued with the most was Jeff Bridges' Obadiah Stane, I just couldn't get over his appearance as Tony Stark's operations chief. The role was played with just the right amount of reserve and just below the surface malice; I thought he did an excellent job. Gwyneth Paltrow had pretty much a thankless job as Stark's personal assistant and secret admirer and it didn't seem to me that her performance was all that stand out.As an aside, the one thing I feel I do have to comment on is a personal gripe of mine relative to the IMDb ranking system. As I write this, \"Iron Man\" sits at number #130 of the all time best films as ranked by current users. It seems to me that the way fans line up behind a picture even before it's released, there ought to be a moratorium of say, two or three years before a new release could be eligible for Top 250 ranking. When you consider the truly great films of all time like \"Casablanca\" or \"Citizen Kane\", it's hard for me to reconcile a popcorn flick like this one to be considered in the same breath. I feel the same way (as to a voting moratorium) about stunning pictures like \"No Country For Old Men\" and \"There Will Be Blood\". If a picture has the legs to stand up as an all time great, it will be remembered a couple years after it's original release. Remember all the fanboy hype about \"Serenity\"? Does anyone even care about that picture today? See what I mean?"},{"username":"lee_eisenberg","userUrl":"https://www.imdb.com/user/ur4888011","reviewLink":"https://www.imdb.com/review/rw1985368","warningSpoilers":false,"date":"4 December 2008","rate":"7","helpful":"1 out of 3 found this helpful.","title":"believe it or not, I'd never heard of Iron Man before this movie came out","content":"Over the years, I had heard of many superheros: Superman, Spider-Man, the Hulk, the X Men. However, until Jon Favreau's \"Iron Man\" came to theaters, I had never heard of Iron Man! That made the movie even more of a treat. I liked how they incorporated world events into the story: in this case, Tony Stark (Robert Downey Jr.) makes weapons for the army but has misgivings after his experience in Afghanistan. I'll admit that I'm not really any fan of superhero stories. But I do think that they did a good job with this movie, so I recommend it.Also starring Terrence Howard, Jeff Bridges, Gwyneth Paltrow, Sayed Badreya, and of course Stan Lee in a brief appearance."},{"username":"gavin6942","userUrl":"https://www.imdb.com/user/ur1234929","reviewLink":"https://www.imdb.com/review/rw2610545","warningSpoilers":false,"date":"12 May 2012","rate":"7","helpful":"0 out of 2 found this helpful.","title":"Far Exceeds The Character's Usual Presentation","content":""},{"username":"jboothmillard","userUrl":"https://www.imdb.com/user/ur4248714","reviewLink":"https://www.imdb.com/review/rw2253376","warningSpoilers":true,"date":"22 May 2010","rate":"8","helpful":"1 out of 11 found this helpful.","title":"Iron Man","content":"Spider-Man was great, the first Hulk wasn't, and the Fantastic Four did okay, and then came this film with Marvel creating their own film studio to complete their piece, from director Jon Favreau (Elf). Basically Tony Stark (National Movie Award nominated Robert Downey Jr.) is the successful and rich head of Stark Industries, who manufacture weapons all over the world, and his life is changed when he is badly wounded in the chest. Tony is saved by a special metal based plate in his chest that keeps the shrapnel from reaching his heart, but he is also forced to create a new weapon by his Middle Eastern captors. In the time he has to build this weapon, he instead creates a metal armoured suit to make his escape and attack all in his way, and he manages it. When Tony returns to the US, he announces that from his experiences, he realises his company is not doing good making weapons, and he starts making modifications to his armour suit design. While Tony changes the design, manufacturing it with gold and titanium, and adding a jet-propulsion system to fly, his second in charge Obadiah Stane (Jeff Bridges) is still selling weapons to the Middle East. While in Afganistan, Stane comes face to face with Tony's original metal suit, and decides that it the new unknown \"Iron Man\" in the city, to go up against him. In the end, after defeating Stane, and against the advice of his crush-driven personal secretary Virginia 'Pepper' Potts (Gwyneth Paltrow), Tony announces to America and the world that he is Iron Man. Also starring Terrence Howard as Rhodey, Leslie Bibb as Christine Everhart, Shaun Toub as Yinsen, Faran Tahir as Raza, Clark Gregg as Agent Coulson, Bill Smitrovich as General Gabriel, Paul Bettany as Jarvis and look out for Stan Lee as the man in the smoking jacket. Downey Jr. has been away as a leading star for a while, and this is a fantastic return for him, and he has great support from a reliable Paltrow, and a mean performance from Bridges. There is good action and adventure, there are great special effects coupled with cool gadgets, and a quite engaging story to carry you along, it is a great fantasy superhero movie. It was nominated the Oscars for Best Sound Editing and Best Visual Effects, it was nominated the BAFTA for Best Special Visual Effects, and it was nominated the National Movie Award for Best Superhero. Very good!"},{"username":"ccthemovieman-1","userUrl":"https://www.imdb.com/user/ur4445210","reviewLink":"https://www.imdb.com/review/rw1958381","warningSpoilers":true,"date":"10 October 2008","rate":"8","helpful":"13 out of 25 found this helpful.","title":"A Fun Two Hours Of Nonsense","content":"Simply put, this was a very entertaining movie.Despite the movie running a little long for an intense, action movie, overall it was still very interesting and fun to watch because the pacing was so good. Neither the action segments nor the lulls, the robot scenes or the soldier scenes nor the very low-key romance is overdone. It's all in good proportion. It's not an innocent based-on-a-comic character film but, frankly, what movie is nowadays? There's always some profanity and sexual innuendos that don't belong in a \"kids\" movie made today. Thankfully, that kind of stuff was a lot lower in content than the recent \"Transformers\" film I viewed.The scenes with \"Iron Man\" a.k.a. \"Tony Stark\" (Robert Downey Jr.) in his suit and demonstrating his spectacular skills were - no surprise - the most fun to watch. (If you have a chance, catch this on Blu-Ray as the transfer is terrific). At the end of the film we get another robot, piloted by the corporate bad guy \"Obadiah Stane\" (Jeff Bridges) and that huge Iron Man-clone is fun to see, too.Some complain the film is not really all that \"smart\" and it's a bit too predictable, but it's fun ride of escapism that offers a good two hours of diversion thanks to very good special-effects and mostly-likable characters. Speaking of characters, it wasn't easy to recognize Bridges with a bald head and full beard but once I heard his distinctive voice, I knew who it was. Gywneth Paltrow played a sweet role as Stark's loyal secretary, \"Pepper Potts.\" (Nice name!!). The Afghanistan villain was credible. Actually, I liked him better than the obnoxious Liberal news reporter, who was annoying.The \"moral\" of the story the screenwriters preach is that military might as a deterrent to fighting terrorists can easily backfire as companies which manufacture arms for the U.S. could also be acquired by bad guys (because of greedy and corrupt U.S. businessmen). This is naive Liberal propaganda, the kind I would expect out of the movie industry, whether in Hollywood or Europe. Sadly, there will never be a shortage of bullies and evil people, who will then crush an unarmed foe as the people in this film attempt to do. It's also implausible any company like the one shown in this movie could so easily travel to a hot spot like Afghanistan and deal with terrorists. It's unrealistic, but that's today's movies for you. Also, despite the nonviolent message in the story, the good guy sure wipes out his share of people with a variety of weapons! For someone preaching peace, he sure didn't hesitate in killing opponents.Iron Man's metal suit is definitely very cool, equipped with about anything you'd need to fight an army of terrorists, or anyone else. The suit - and his super pacemaker - turn him into a Superman-type guy in that he can fly pretty high and pretty high. The latter part - how high he could fly - makes a nice conclusion, by the way, regarding the good guy's battle against the \"bad Iron Man.\""},{"username":"Tweekums","userUrl":"https://www.imdb.com/user/ur13977076","reviewLink":"https://www.imdb.com/review/rw2424303","warningSpoilers":true,"date":"4 May 2011","rate":"8","helpful":"3 out of 5 found this helpful.","title":"A solid introduction to the Iron man character","content":"At first glance Tony Stark isn't the sort of person you'd expect to become a superhero; he is a genius who has made his fortune inventing and selling state of the art weapons systems. At least he was until he is captured by insurgents in Afghanistan and learns that it isn't only the good guys who use his products. Once they have him the insurgents instruct him to make them a version of his latest weapon; instead he makes an armoured suit that renders him bullet proof and even enables him to fly. Using the suit he manages to escape and when he gets back to the United States he renounces the arms trade much to the consternation of this erstwhile partner. Tony now devotes his time to making a new improved version of the suit which he uses to protect the people that where being oppressed by his company's weapons. He isn't the only person with an armoured suit though; his partner Obadiah Stane is building one too and when it is completed he will attempt to destroy Tony.I found the earlier parts of this film to be the best; Robert Downey Jr. did a good job as Tony Stark making his damascene conversion from arms dealer to protector of the innocent believable at the end the story was just about two giant robots I mean men in power suits fighting; although I'm sure that is the scene younger members of the audience will enjoy most. Jeff Bridges also put in a good performance as bad guy Obadiah and Gwyneth Paltrow was fine as Tony's PA Pepper Potts. I was rather pleased that they managed to avoid the cliché of Tony and Pepper becoming a couple even if it was hinted that they might become one in the future. Unlike a lot of super heroes Tony Stark has no problem with killing his enemies and the weapons he uses may mean some parents might not thing this film is suitable for younger children."},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw2684845","warningSpoilers":false,"date":"7 October 2012","rate":"9","helpful":"1 out of 2 found this helpful.","title":"You'll believe an Iron Man can fly!","content":""},{"username":"TxMike","userUrl":"https://www.imdb.com/user/ur0438066","reviewLink":"https://www.imdb.com/review/rw1967449","warningSpoilers":true,"date":"29 October 2008","rate":"","helpful":"4 out of 6 found this helpful.","title":"Stan Lee must have a big grin on his face, seeing his Iron Man on the big screen.","content":"A really, really good comic book action movie. The snappy dialog, good acting, and good directing make all the difference.I've always enjoyed Robert Downey Jr., even in his TV roles, and here he carries the movie as Tony Stark, boy genius and inventor who after his father's death gains control of the biggest corporation making missiles and other machines of war. Tony continues what his father had built, and takes it a few steps further with his own inventions.Another actor I always like is Terrence Howard, and here he is long time friend of Tony's, and a military officer, Rhodey.Tony's right hand man in his company is Jeff Bridges as Obadiah Stane. He had run the company while Tony was still growing up and seems to want to continue his expanded role.Good as Tony's trusty personal assistant is Gwyneth Paltrow as Pepper Potts. She is not only a loyal employee but also a sort of \"pal\" to Tony, yet it seems that she wishes there were more between them.The story centers on an incident where Tony had travels to a war zone to demonstrate to the US military their newest weapon. But there is a motorcade attack and Tony gets imprisoned, with the demand that he develop the new weapon for them. Instead he invents something new, a rather crude iron man suit that he eventually uses to break free. But the experience changes him, as he sees that even the enemy have weapons that his company makes. His big decision when back home is to quit making weapons and instead concentrate on helping humanity.SPOILERS: When back home Tony works hard to perfect a sleek new Iron Man suit, one that can fly anywhere and even at supersonic speeds, and that has exotic weapon and navigational capabilities. In the process he has Pepper track down through company records how enemies were getting weapons. It turns out to be Obadiah, who is trying to get Tony killed so that he can run the corporation and enrich himself further with illegal weapons sales. The climax comes when Obadiah gets into a larger, more powerful iron man suit, and he and Tony battle. With Pepper's help he overcomes Obadiah, and in a conference reveals that he, Tony, is indeed the Iron Man."},{"username":"Quinoa1984","userUrl":"https://www.imdb.com/user/ur0453068","reviewLink":"https://www.imdb.com/review/rw1867210","warningSpoilers":false,"date":"2 May 2008","rate":"10","helpful":"21 out of 40 found this helpful.","title":"supreme comic-book entertainment; it's also more jaded, and funnier, than most in its genre","content":""},{"username":"tavm","userUrl":"https://www.imdb.com/user/ur11228318","reviewLink":"https://www.imdb.com/review/rw1873252","warningSpoilers":true,"date":"12 May 2008","rate":"9","helpful":"1 out of 3 found this helpful.","title":"Iron Man is an exciting beginning for the summer movie season","content":"While I have long been a fan of various superhero movies, I admit I only have a passing interest in the \"Iron Man\" comic books since I only read some '80s issues my brother owned when Tony Stark was suffering from alcoholism and a black associate had taken the mantle. That said, this was a pretty cool action movie directed by Jon Favreau with some subtle humor shoehorned in courtesy of Robert Downey, Jr. as Stark and Gwyneth Paltrow as his associate Pepper Potts. What a nicely romantic team they play here! While there's also Terrence Howard and Jeff Bridges to fill up the capable supporting cast, I must mention Clark Gregg as a SHIELD agent who has his own amusing moments in his brief scenes with Ms. Paltrow. He's a regular on \"The New Adventures of Old Christine\". There's great drama in Afganistan and plenty of kick-butt action in whatever city this movie takes place in that I was wholly enthralled the whole way through. With a sequel already being planned, I wholly look forward to the next adventures of Iron Man! P.S. Check out Stan Lee being mistaken for Hugh Hefner here."},{"username":"edwagreen","userUrl":"https://www.imdb.com/user/ur2542703","reviewLink":"https://www.imdb.com/review/rw1976004","warningSpoilers":true,"date":"15 November 2008","rate":"5","helpful":"1 out of 3 found this helpful.","title":"Iron Man Meets its Mettle **1/2","content":"Action-pact thriller provides a field day for Robert Downey, Jr. He plays a wealthy guy, who after being imprisoned by terrorists in Afghanistan, swears off the making of military hardware, but at the same time creates Iron Man, a robot-like specimen that will destroy all evil in its path.As his assistant and lover, Gwyneth Paltrow has found a role that is totally beneath that of a former Oscar winner.Jeff Bridges is excellent as his adviser. It doesn't take much to realize that Bridges has his own agenda in this film and that he is up to absolutely no good whatsoever.The kids will love the special affects here, especially the fight between the two robots (Downey and Bridges) on that bridge near the film's end."},{"username":"Gordon-11","userUrl":"https://www.imdb.com/user/ur0035842","reviewLink":"https://www.imdb.com/review/rw1951632","warningSpoilers":false,"date":"25 September 2008","rate":"","helpful":"0 out of 5 found this helpful.","title":"Disappointing script, sparse action scenes","content":"This film is about a wealthy weapon developer making a superhero suit, and uses it to fight against evil forces.After watching \"Iron Man\" I felt so disappointed. I think it is not as good as the ratings suggest. The pacing is incredibly slow for a fantasy action hero movie. It's well over 30 minutes and Stark is still developing the suit! The plot is not very engaging either, it is not exciting enough. The characters are poorly developed too. I do not find myself care for any of the characters, except maybe Stark. Poor Gwyneth Paltrow, she is such a supporting character in here, and her role could be played by anyone. Action scenes are sparse and short, and not exciting at all. The subplot about battles in Afghanistan feels more like an oppositional political propaganda, rather than the story actually needs. \"Iron Man\" needs a script rewrite and a much tighter editing to make it more thrilling."},{"username":"michaelRokeefe","userUrl":"https://www.imdb.com/user/ur0449021","reviewLink":"https://www.imdb.com/review/rw1868167","warningSpoilers":true,"date":"3 May 2008","rate":"9","helpful":"4 out of 8 found this helpful.","title":"Genuine blockbuster.","content":"Iron Man is based on the fictional Marvel Comics character Iron Man. You say that Robert Downey Jr is just not the super hero type...get over it. He plays Tony Stark the billionaire industrialist, who manufactures superior weapons of war. Stark is captured by terrorists in Afghanistan with the promise of freedom if he builds a highly destructive missile for them. Instead he builds a suit of armor to make his escape. Stark realizes that many of his weapons are being used to kill Americans in combat. He holds a press conference expounding his manufacturing empire will quit the production of weapons. He puts a lot of effort in perfecting his armored suit to turn himself into the highly technological hero Iron Man. Gwyneth Paltrow plays his faithful personal assistant Pepper Potts. Terrence Howard is his jet pilot friend James Rhodes. And his mentor and business partner Obadiah Stane(Jeff Bridges) is the essence of evil covertly ordering a hit to kill Stark and take over his empire. Also in the cast: Faran Tahir, Sayed Badreya, Shaun Toub and the gorgeous Leslie Bibb. FX and CGI are commanding and superb. You really get the bang for your buck. The film's stars have already signed on to do two sequels."}],"errorMessage":""}