{"imDbId":"tt0371746","title":"Iron Man","fullTitle":"Iron Man (2008)","type":"Movie","year":"2008","items":[{"publisher":"Variety","author":"Todd McCarthy","link":"","rate":"100","content":"Ever-eclectic director Jon Favreau, who briefly pops up onscreen as a Stark minion, maintains a brisk but not frantic pace, and, in concert with lenser Matthew Libatique, production designer J. Michael Riva and the first-rate visual effects team, has made an unusually elegant looking film for the genre."},{"publisher":"The Hollywood Reporter","author":"Kirk Honeycutt","link":"","rate":"90","content":"Downey plays off his own bad-boy image wonderfully. The writers give him great lines to work with and ditto that for his Girl Friday, Gwyneth Paltrow's Pepper Potts, whose own svelte lines cannot be improved on."},{"publisher":"New York Magazine (Vulture)","author":"David Edelstein","link":"https://nymag.com/movies/reviews/46460/","rate":"90","content":"Loyal assistant, Pepper Potts, isn't much of a part, but Gwyneth Paltrow is a presence. She stands around looking amused and flabbergastingly pretty, slinging wisecracks with serene aplomb."},{"publisher":"Village Voice","author":"","link":"","rate":"90","content":"Iron Man, too, is something that people will see regardless of the reviews, but here is the point: Where Michael Bay (Transformers) has mastered a kind of sensory-assaulting pop art, Favreau is a born storyteller who engages the audience's imagination rather than crushing it in a tsunami of digital noise."},{"publisher":"Rolling Stone","author":"Peter Travers","link":"","rate":"88","content":"All praise to acting dynamo Robert Downey Jr., who brings so much creative juice to the party that Iron Man achieves instant liftoff."},{"publisher":"ReelViews","author":"James Berardinelli","link":"https://www.reelviews.net/movies/i/iron_man.html","rate":"88","content":"When it comes to tone, Iron Man achieves something at which many of even its most celebrated predecessors have failed: it doesn't FEEL like a superhero movie. Instead, it's bigger and more inclusive."},{"publisher":"Austin Chronicle","author":"Marc Savlov","link":"https://www.austinchronicle.com/events/film/2008-05-02/iron-man/","rate":"78","content":"And Favreau? If you'd told me 12 years ago that Swingers' comic linchpin would end up helming one of the best, most visceral, and downright fun foray of all the comic-book franchises waiting in the CGI wings, I'd have told you to amscray, kid. But what the hell? Turns out irony's good for your blood."},{"publisher":"Premiere","author":"Glenn Kenny","link":"","rate":"75","content":"Iron Man is the first Marvel Comics superhero movie I would willingly sit through a second time. This is the result not just of what the movie does, but what the movie doesn't do."},{"publisher":"Empire","author":"Dan Jolin","link":"","rate":"60","content":"It's not sure where to go once the final Iron Man suit is constructed, and seems in a rush to get there, but Downey Jr and the supporting cast are so perfectly placed we're already looking forward to the bound-to-be-better sequel."},{"publisher":"The New Yorker","author":"David Denby","link":"https://www.newyorker.com/magazine/2008/05/05/unsafe","rate":"50","content":"[Downey] can make offhandedness mesmerizing, even soulful; he passes through the key moments in this cloddish story as if he were ad-libbing his inner life."}],"errorMessage":""}